# Cost comparison: reference Barrett multiplier vs proposed K-RED unit,
# and reference butterfly vs proposed butterfly, after generic synth.
design -reset
read_verilog ../../cfntt_ref/hardware_code_radix-2/modular_mul.v
read_verilog ../../cfntt_ref/hardware_code_radix-2/common_lib.v
synth -top modular_mul -noabc
stat -width

design -reset
read_verilog modular_mul_kred.v
synth -top modular_mul_kred -noabc
stat -width

design -reset
read_verilog ../../cfntt_ref/hardware_code_radix-2/compact_bf.v
read_verilog ../../cfntt_ref/hardware_code_radix-2/modular_mul.v
read_verilog ../../cfntt_ref/hardware_code_radix-2/modular_add.v
read_verilog ../../cfntt_ref/hardware_code_radix-2/modular_substraction.v
read_verilog ../../cfntt_ref/hardware_code_radix-2/common_lib.v
synth -top compact_bf -noabc -flatten
stat -width

design -reset
read_verilog compact_bf_v2.v
read_verilog modular_mul_kred.v
read_verilog ../../cfntt_ref/hardware_code_radix-2/modular_add.v
read_verilog ../../cfntt_ref/hardware_code_radix-2/modular_substraction.v
read_verilog ../../cfntt_ref/hardware_code_radix-2/modular_half.v
read_verilog ../../cfntt_ref/hardware_code_radix-2/common_lib.v
synth -top compact_bf_v2 -noabc -flatten
stat -width
