# running in fv_rom_fold_bmc/src/
read -formal -sv fv_rom_fold.sv
read -formal tf_rom_fold.v
read -formal tf_ROM.v
prep -top fv_rom_fold

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
